package com.boryanz.upszakoni.data

enum class NavigationDrawerDestination {
  laws,
  privacy_policy,
  information,
  generate_document
}

val privacyPolictyText =
  "„УПС“ апликацијата не го претставува Министерството за внатрешни работи, ниту било каква државна институција. Оваа апликација не собира, ниту обработува лични податоци на корисниците, како што се име, адреса или телефонски број. Апликацијата не пристапува, ниту користи физичка локација на корисниците, а сите податоци што се користат се строго статички, јавно достапни информации кои можат да се најдат од секого. \n" +
      "\n" +
      "Ве молиме, имајте во предвид некои од правните членови што се користат во оваа апликација можат да станат застарени во одреден момент и ваша должност е да ја проверите точноста на информациите. Заедницата ќе има корист доколку корисниците достават нови правни, пречистени текстови или предлози за подобрување на следниот меил: boryans.co@gmail.com\n" +
      "\n" +
      "Апликацијата е развиена доброволно од поединец, со цел да им помогне на лицата кои се спроведувачи на законот."

