package com.boryanz.upszakoni.ui.screens.ai

const val AI_SYSTEM_PROMPT = """
Улога: Ти си искусна вештачка интелигенција, обучена да дејствува како искусен полициски службеник, специјализиран за пишување службени белешки СЛЕДЕЈКИ го примерот од претходно напишаната белешка.

Цел: Генерирај ПРАВНО ОДРЖАНА и СУДСКО ОДБРАНЛИВА службена белешка, напишана во професионален тон и со употреба на полициска терминологија од Северна Македонија.

Критична Напомена за AI: Белешката мора да содржи не само што службеникот направил (според описот), туку и што ТРЕБАЛО ДА НАПРАВИ (на пр., проверка во систем) со цел да се покријат потенцијалните процедурални пропусти и да се зајакне правната одбрана. Стилот
на пишување прилагоди го од пример - белешката која што е напишана претходно.

Нова Забрана: Строго забрането е користење на бројки на правни членови или закони во текстот на белешката.

Форматирање и Излез (Задолжително Чист HTML):
Формат на излез: Целокупниот одговор мора да биде генериран во чист HTML код.
Забрана за Markdown: СТРОГО ЗАБРАНЕТО е користење на какви било Markdown ознаки (**, #, *, ---, итн.).
Текст Формат (Белешка): Структура на есеј во кратки, логични параграфи, користејќи HTML тагови за <STRONG>болдирање</STRONG> и <P>параграфи</P>.
Лични Податоци: Секој личен податок (име, адреса, ДЛК, рег. табла, итн.) замени го со _______.

Баран HTML Излез:

HTML

<H1>СЛУЖБЕНА БЕЛЕШКА</H1>
<P>...</P>

<BR><BR>

<H2>Препорачана Постапка на Настанот:</H2>
<OL>
<LI></LI>
<BR><BR>
<LI></LI>
<BR><BR>
<LI></LI>
<BR><BR>
<LI></LI>
<BR><BR>
<LI></LI>
</OL>
ОПИС ОД ПОЛИЦИСКИОТ СЛУЖБЕНИК:
"""


const val PUBLIC_ORDER_AND_PEACE_PROMPT = """
 На [датум] во [час] од страна на [одговорно лице (Дежурна, Старешина и сл.)] бев испратен на [улица]
 по претходна пријава за нарушен ЈРМ за [прекршок од закон за ЈРМ]. Со излегување на горенаведената адреса,
 обавен е разговор со пријавителот, лицето _________ со ЕМБГ _________, број л.к ____________ и адреса на живеење
 ________ кој ни појасни дека на ______ [датум] во ______ [час] на улица _______ додека пешачел бил физички нападнат
 од страна на НН лице, на тој начин што, истиот дошол на наведеното место и без повод и причина го удрил со два бокс тупаници
 во пределот на лицето при што избегал во НН правец. А пријавителот се здобил со модринки и црвенило. Опис на НН лицето __________
 Од страна на полицискиот службеник сочинет е (наведи службен материјал). 
 Од страна на полицискиот службеник известени се (Дежурна, старешина и сл..) за превземените мерки.
"""

const val COMPLAINT_PROMPT = """
 На [датум] во [час] од страна на [одговорно лице (Дежурна, Старешина и сл.)] бев испратен на [улица]
 по претходна пријава за поплака. Од наша страна излезено е на горенаведената адреса,
 обавен е разговор со пријавителот, лицето _________ со ЕМБГ _________, број л.к ____________ и адреса на живеење
 ________ кој ни појасни дека на ______ [датум] во ______ [час] на улица _______ во времето предвидено за одмор
 бил вознемируван на тој начин што од неговиот сосед вршел градежни активности во станот кој што живеел. 
 По обавениот разговор стапено е во контакт со лицето _______ со ЕМБГ ________, број Л.к. _________ и адреса на живеење _______
 при што од наша страна е усно предупреден да не врши градежни активности во времето предвидено за одмор.
 Предупредувањето го прифати во целост, а пријавителот е известен за преземените мерки.
 Од страна на полицискиот службеник сочинет е (наведи службен материјал). 
"""

const val SECURING_CRIME_SCENE_PROMPT = """
 На [датум] во [час] од страна на [одговорно лице (Дежурна, Старешина и сл.)] бев испратен на [улица]
 по претходна пријава за тешка кражба. Од наша страна излезено е на горенаведената адреса,
 обавен е разговор со пријавителот, лицето _________ со ЕМБГ _________, број л.к ____________ и адреса на живеење
 ________ кој ни појасни дека на во временскиот период од ______ до _______ од страна на НН сторител извршена му е 
 тешка кражба од помошна просторија во неговиот двор. 
 НН сторителот, дошол во наведеното време и место и со употреба на тврд предмет делувал на бравата и катанецот на вратата,
 по што влегол внатре и изршил претурање и пребаруваење, и одзел ______ (предмети). По што незабележан од никого заминал во НН правец, причинувајки
 материјлна штета од _______ денари и се стекнал со противправна имотна корист од _______ денари.
 На лице место инспектори од _______ (соодветна единица). 
 Од наша страна известени се _______ (Дежурна служба, старешини...) и сочинет е (наведи службен материјал). 
"""
